# <font color='red'>Data Cleaning and Preparation</font>
During the course of doing data analysis and modeling, a significant amount of time
is spent on data preparation: loading, cleaning, transforming, and rearranging. Such
tasks are often reported to take up 80% or more of an analystâ€™s time. Sometimes the
way that data is stored in files or databases is not in the right format for a particular
task. Many researchers choose to do ad hoc processing of data from one form to
another using a general-purpose programming language, like Python, Perl, R, or Java,
or Unix text-processing tools like sed or awk. Fortunately, pandas, along with the
built-in Python language features, provides you with a high-level, flexible, and fast set
of tools to enable you to manipulate data into the right form.

In [2]:
import pandas as pd
import numpy as np

## Handling Missing Data
The way that missing data is represented in pandas objects is somewhat imperfect,
but it is functional for a lot of users. For numeric data, pandas uses the floating-point
value NaN (Not a Number) to represent missing data. We call this a sentinel value that
can be easily detected:

In [8]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [9]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [10]:
string_data[1]=None
string_data

0    aardvark
1        None
2         NaN
3     avocado
dtype: object

In [12]:
string_data.dropna()

0    aardvark
3     avocado
dtype: object

In [14]:
string_data.fillna(11)

0    aardvark
1          11
2          11
3     avocado
dtype: object

In [15]:
string_data.isnull()

0    False
1     True
2     True
3    False
dtype: bool

In [16]:
string_data.notnull()

0     True
1    False
2    False
3     True
dtype: bool

# Filtering Out Missing Data
With DataFrame objects, things are a bit more complex. You may want to drop rows
or columns that are all NA or only those containing any NAs. dropna by default drops
any row containing a missing value:

In [19]:
from numpy import nan as NA
data = pd.Series([1, NA, 3.5, NA, 7])
data.dropna()
#This is equivalent to:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [21]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                     [NA, NA, NA], [NA, 6.5, 3.]])
cleaned=data.dropna()
cleaned

     0    1    2
0  1.0  6.5  3.0

In [22]:
#Passing how='all' will only drop rows that are all NA:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [25]:
#To drop columns in the same way, pass axis=1 :
data[3]=NA
display(data)
data.dropna(axis=1,how='all')

     0    1    2   3
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [31]:
df=pd.DataFrame(np.random.randn(7,3))
df.iloc[2:6,0]=NA
df.iloc[1:3,2]=NA
df

          0         1         2
0 -0.654305  1.234382 -0.141375
1  0.146917  2.148360       NaN
2       NaN  0.324579       NaN
3       NaN  1.058071  0.564012
4       NaN -0.389068  0.079730
5       NaN  0.399291  0.602079
6 -0.056872  1.137850 -1.389623

In [32]:
df.dropna(thresh=2)

          0         1         2
0 -0.654305  1.234382 -0.141375
1  0.146917  2.148360       NaN
3       NaN  1.058071  0.564012
4       NaN -0.389068  0.079730
5       NaN  0.399291  0.602079
6 -0.056872  1.137850 -1.389623

# Filling In Missing Data

In [39]:
df.fillna(0)

          0         1         2
0 -0.654305  1.234382 -0.141375
1  0.146917  2.148360  0.000000
2  0.000000  0.324579  0.000000
3  0.000000  1.058071  0.564012
4  0.000000 -0.389068  0.079730
5  0.000000  0.399291  0.602079
6 -0.056872  1.137850 -1.389623

In [43]:
#Calling fillna with a dict, you can use a different fill value for each column:
df.fillna({0:0.0,2:0.1})

          0         1         2
0 -0.654305  1.234382 -0.141375
1  0.146917  2.148360  0.100000
2  0.000000  0.324579  0.100000
3  0.000000  1.058071  0.564012
4  0.000000 -0.389068  0.079730
5  0.000000  0.399291  0.602079
6 -0.056872  1.137850 -1.389623

In [45]:
#fillna returns a new object, but you can modify the existing object in-place:
_=df.fillna(0,inplace=True)
df

          0         1         2
0 -0.654305  1.234382 -0.141375
1  0.146917  2.148360  0.000000
2  0.000000  0.324579  0.000000
3  0.000000  1.058071  0.564012
4  0.000000 -0.389068  0.079730
5  0.000000  0.399291  0.602079
6 -0.056872  1.137850 -1.389623

In [46]:
df = pd.DataFrame(np.random.randn(6, 3))
df

          0         1         2
0 -0.275880 -0.453614 -0.892080
1 -1.105181 -1.431437  1.603356
2  1.314761  0.915049 -0.169354
3 -1.146502  0.676129 -0.396727
4  0.915869 -1.762676  2.462247
5  0.017651  1.580312  0.352232

In [48]:
df.iloc[2:,0]=NA
df.iloc[0:3,2]=NA
df

          0         1         2
0 -0.275880 -0.453614       NaN
1 -1.105181 -1.431437       NaN
2       NaN  0.915049       NaN
3       NaN  0.676129 -0.396727
4       NaN -1.762676  2.462247
5       NaN  1.580312  0.352232

In [50]:
df.fillna(method='ffill',limit=2)

          0         1         2
0 -0.275880 -0.453614       NaN
1 -1.105181 -1.431437       NaN
2 -1.105181  0.915049       NaN
3 -1.105181  0.676129 -0.396727
4       NaN -1.762676  2.462247
5       NaN  1.580312  0.352232

In [52]:
df.fillna(df.mean())

          0         1         2
0 -0.275880 -0.453614  0.805917
1 -1.105181 -1.431437  0.805917
2 -0.690531  0.915049  0.805917
3 -0.690531  0.676129 -0.396727
4 -0.690531 -1.762676  2.462247
5 -0.690531  1.580312  0.352232

In [53]:
df.fillna(value=22)

           0         1          2
0  -0.275880 -0.453614  22.000000
1  -1.105181 -1.431437  22.000000
2  22.000000  0.915049  22.000000
3  22.000000  0.676129  -0.396727
4  22.000000 -1.762676   2.462247
5  22.000000  1.580312   0.352232

In [59]:
df.fillna(method='ffill',axis=1)

          0         1         2
0 -0.275880 -0.453614 -0.453614
1 -1.105181 -1.431437 -1.431437
2       NaN  0.915049  0.915049
3       NaN  0.676129 -0.396727
4       NaN -1.762676  2.462247
5       NaN  1.580312  0.352232

# Data Transformation
   <ol>
    <li><a id >Removing Duplicates</a></li>
    <li><a id ></a></li>
    <li><a id ></a></li>
    <li><a id ></a></li>
    </ol>

In [66]:
rm_Dp=pd.DataFrame({'k1':['one','two']*3 +['two'],
                    'k2':[1, 1, 2, 3, 3, 4, 4]})
rm_Dp

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [70]:
rm_Dp.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [73]:
rm_Dp.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [74]:
rm_Dp['v1']=range(7)
rm_Dp.drop_duplicates('k1')

    k1  k2  v1
0  one   1   0
1  two   1   1

In [77]:
rm_Dp.drop_duplicates(['k1','k2'],keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

# Transforming Data using function or maping

In [79]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                              'Pastrami', 'corned beef', 'Bacon','pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [113]:
meat_to_animal = {
    'bacon': 'pig','pulled pork': 'pig','pastrami': 'cow',
    'corned beef': 'cow','honey ham': 'pig','nova lox': 'salmon'}
meat_to_animal

{'bacon': 'pig',
 'pulled pork': 'pig',
 'pastrami': 'cow',
 'corned beef': 'cow',
 'honey ham': 'pig',
 'nova lox': 'salmon'}

In [82]:
lowercased=data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [84]:
data['animal']=lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [86]:
#We could also have passed a function that does all the work:
data['food'].map(lambda x: meat_to_animal[x.lower()])
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [99]:
data1=pd.DataFrame({
    'items':['Buble','CHocolate','nuts','toffee'],
    'RS':[12,22,33,21]
})
data1

       items  RS
0      buble  12
1  chocolate  22
2       nuts  33
3     toffee  21

In [107]:
data_2={'buble':'ahmad likes','chocolate':'Ali Likes','nuts':'shahir likes','toffee':'arosH likes'}

In [114]:
lwrcsd=data1['items'].str.lower()
lwrcsd

0        buble
1    chocolate
2         nuts
3       toffee
Name: items, dtype: object

In [119]:
data1['items'].map(lambda x: data_2[x.lower()])
data1

       items  RS
0      buble  12
1  chocolate  22
2       nuts  33
3     toffee  21

In [120]:
data1['favorite']=lwrcsd.map(data_2)

In [121]:
data1

       items  RS      favorite
0      buble  12   ahmad likes
1  chocolate  22     Ali Likes
2       nuts  33  shahir likes
3     toffee  21   arosH likes

In [125]:
#data1['items'].map(lambda x: lwrcsd([x.lower()]))
data1['items'].map(lambda x: data_2[x.lower()])
data1

       items  RS      favorite
0      buble  12   ahmad likes
1  chocolate  22     Ali Likes
2       nuts  33  shahir likes
3     toffee  21   arosH likes